soap-mocks/src/main/resources/generic_soap_mocks/HelloWorldResponse.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<typ:HelloWorldRepsonse
			xmlns:typ="http://soapmocks.de">
			<wow/>
		</typ:HelloWorldRepsonse>
	</soap:Body>
</soap:Envelope>